zhaozhentao/Stm32f103c8t6UCOSIII/Src/cpu_task.c
#include <os.h>
#include "stm32f1xx_hal.h"
#include <stdio.h>

#define  APP_TASK_STATUS_PRIO                       6
#define  APP_TASK_STATUS_STK_SIZE                   128

extern OS_TCB LedTaskTCB;
extern OS_TCB UartTaskTCB;

static OS_TCB AppTaskStatusTCB;

static CPU_STK AppTaskStatusStk[APP_TASK_STATUS_STK_SIZE];

void AppTaskStatus(void *p_arg) {
    OS_ERR err;

//    CPU_SR_ALLOC();

    (void) p_arg;

    while (1) {
        printf("CPU利用率：%d.%d%%\r\n", OSStatTaskCPUUsage / 100, OSStatTaskCPUUsage % 100);

        OSTimeDlyHMSM(0, 0, 1, 0, OS_OPT_TIME_PERIODIC, &err);
    }
}

void createCPUTask(void) {
    OS_ERR err;

    OSTaskCreate((OS_TCB * ) & AppTaskStatusTCB,
                 (CPU_CHAR *) "App Task Status",
                 (OS_TASK_PTR) AppTaskStatus,
                 (void *) 0,
                 (OS_PRIO) APP_TASK_STATUS_PRIO,
                 (CPU_STK * ) & AppTaskStatusStk[0],
                 (CPU_STK_SIZE) APP_TASK_STATUS_STK_SIZE / 10,
                 (CPU_STK_SIZE) APP_TASK_STATUS_STK_SIZE,
                 (OS_MSG_QTY) 5u,
                 (OS_TICK) 0u,
                 (void *) 0,
                 (OS_OPT)(OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR),
                 (OS_ERR * ) & err);
}
